/*
********************************************************************************
                                IO控制

文件名    ：io_output.h
版本      ：
程序员    ：Tank_CG
********************************************************************************
说明：
********************************************************************************
*/

#ifndef __IO_OUTPUT_H
#define __IO_OUTPUT_H

/*
********************************************************************************
                               头文件        
********************************************************************************
*/

#include "stm32f10x.h"
#include "app_conf.h"
/*
********************************************************************************
                               宏定义      
********************************************************************************
*/


#define         RELAY_2		1                //电继电器					
#define         RELAY_1		2                //继电器

#define         DIR_FORWARD     0   //前进  
#define         DIR_BACK        1  //倒车
#define         DIR_LEFT        2  //逆时针旋转
#define         DIR_RIGHT       3  //顺时针旋转

#define	        LED_ALARM       1   //报警指示灯	
#define         RUN_NOAMAL      0
#define         TURN_LEFT       1
#define         TURN_RIGHT      2




/*
********************************************************************************
                               函数申明      
********************************************************************************
*/

void    OutPutInit       (void);
void    relayControl     (uint8_t num, SwitchState state);
void    ledControl       (uint8_t num, SwitchState state);
void    MotorEnable      (uint8_t enable);
void    DriveDirection   (uint8_t dir);


#endif
